{
  "moduls": [
    {
      "id": "6908",
      "name": "Apa itu UI/UX",
      "description1": "UI (User Interface) adalah sebuah proses desain yang digunakan untuk membangun tampilan antarmuka di layar aplikasi atau komputer yang berfokus pada penampilan atau gaya. UI Designer bertujuan untuk membuat antarmuka yang menurut pengguna mudah digunakan dan menyenangkan. Desain UI mengacu pada grafis antarmuka pengguna dan bentuk lainnya.",
      "description2": "Sedangkan UX (User Experience) adalah sebuah proses untuk mempermudah pengguna dalam mencapai tujuannya saat menggunakan semua aspek dari sebuah produk, baik itu produk digital ataupun produk non-digital, dan diselarasikan dengan tujuan bisnis dari perusahaan produsen produk tersebut.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/41"
    },
    {
      "id": "7793",
      "name": "Perbedaan UI dan UX",
      "description1": "UX Design adalah proses menciptakan produk yang memberikan pengalaman bermakna dan relevan bagi pengguna. Menurut Dor Norman UX (User Experience) mencakup semua aspek interaksi pengguna akhir dengan perusahaan, layanannya, dan produknya. UX Design juga melibatkan desain dari seluruh proses memperoleh dan mengintegrasikan produk, termasuk aspek branding, desain, kegunaan, dan fungsi.",
      "description2": "UI Design difokuskan pada bagaimana tampilan dan fungsi permukaan pada suatu produk. UI adalah jembatan yang membawa kita ke tempat yang ingin kita tuju, Sedangkan UX adalah perasaan yang kita dapatkan saat kita tiba.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/07"
    },
    {
      "id": "5472",
      "name": "Pengertian HTML",
      "description1": "HTML adalah singkatan dari Hypertext Mark Up Language yang merupakan bahasa standar pemrograman untuk membuat suatu website yang bisa diakses dengan internet. Dengan kata lain halaman website yang kita lihat dan kita baca disusun dengan menggunakan bahasa ini dan kemudian diterjemahkan oleh komputer agar dapat dipahami oleh penggunanya.",
      "description2": "Menurut Astamal (2006:8), HTML (Hyper Text Markup Language) adalah simbol-simbol atau tag-tag yang dituliskan dalam sebuah file yang dimaksudkan untuk menampilkan halaman pada web browser. Tag-tag HTML selalu diawali dengan dan diakhiri dengan dimana x tag HTML seperti b, i, u dan sebagainya. Namun ada juga tag yang tidak diakhiri dengan tanda.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/07"
    },
    {
      "id": "2099",
      "name": "Pengertian CSS",
      "description1": "",
      "description2": "",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/07"
    }
  ]
}
